In [1]:
import pandas as pd

In [2]:
data = pd.read_excel("strategy_results_train.xlsx")

In [3]:
data.head()

,id,label,date,open,high,low,close,volume,ma5,ma10,ma15,cmo14,rsi6,mom10
0,SHSE.600085_201501,0,2014-12-30,20.900000,22.090000,20.799999,22.049999,25457468.0,21.291999,21.369,21.636000,23.528606,67.422912,0.230000
1,SHSE.600085_201502,1,2015-01-30,22.990000,23.190001,22.510000,22.580000,7880595.0,23.320000,23.386,23.590000,-7.337719,33.069972,-1.850000
2,SHSE.600085_201503,1,2015-02-27,22.520000,22.670000,22.400000,22.540001,9263796.0,22.442000,22.106,22.165333,1.911593,57.292366,-0.070000
3,SHSE.600085_201504,1,2015-03-30,26.219999,26.440001,25.820000,26.230000,16125626.0,26.378000,25.148,24.380667,39.978429,73.065077,2.559999
4,SHSE.600085_201505,1,2015-04-29,32.580002,33.639999,32.279999,33.180000,13959795.0,32.888000,32.902,32.436000,31.894232,60.800069,1.500000

In [4]:
data2 = pd.concat( [data.iloc[:, 1], data.iloc[:, 8:]], axis=1)

In [5]:
data2.head()

   label        ma5    ma10       ma15      cmo14       rsi6     mom10
0      0  21.291999  21.369  21.636000  23.528606  67.422912  0.230000
1      1  23.320000  23.386  23.590000  -7.337719  33.069972 -1.850000
2      1  22.442000  22.106  22.165333   1.911593  57.292366 -0.070000
3      1  26.378000  25.148  24.380667  39.978429  73.065077  2.559999
4      1  32.888000  32.902  32.436000  31.894232  60.800069  1.500000

In [6]:
data2.isnull().any()

label    False
ma5       True
ma10      True
ma15      True
cmo14     True
rsi6      True
mom10     True
dtype: bool

In [7]:
data2 = data2.dropna(axis = 0)
data2.isnull().any()

label    False
ma5      False
ma10     False
ma15     False
cmo14    False
rsi6     False
mom10    False
dtype: bool

In [8]:
y = data2["label"]
y

0        0
1        1
2        1
3        1
4        1
        ..
31942    1
31943    0
31944    0
31945    0
31946    0
Name: label, Length: 31877, dtype: int64

In [9]:
X = data2.iloc[:, 1:]

In [10]:
X

             ma5       ma10       ma15      cmo14       rsi6     mom10
0      21.291999  21.369000  21.636000  23.528606  67.422912  0.230000
1      23.320000  23.386000  23.590000  -7.337719  33.069972 -1.850000
2      22.442000  22.106000  22.165333   1.911593  57.292366 -0.070000
3      26.378000  25.148000  24.380667  39.978429  73.065077  2.559999
4      32.888000  32.902000  32.436000  31.894232  60.800069  1.500000
...          ...        ...        ...        ...        ...       ...
31942  58.442000  60.356001  60.682667  -4.493080  35.793793 -8.210003
31943  56.290000  55.929000  56.114000  -7.649444  40.306764 -0.150002
31944  55.034000  53.455999  52.943999  23.641532  79.180987  6.150002
31945  45.882000  47.193000  49.858000 -23.226852  37.476424 -8.170002
31946  49.150001  50.371001  51.181334 -21.302773  25.939419 -5.430000

[31877 rows x 6 columns]

In [11]:
X = X.dropna(axis = 0)

In [12]:
X.isnull().any()

ma5      False
ma10     False
ma15     False
cmo14    False
rsi6     False
mom10    False
dtype: bool

In [13]:
X.shape

(31877, 6)

In [14]:
from sklearn.ensemble import RandomForestClassifier
clf = RandomForestClassifier()
clf.fit(X, y)

C:\Users\joan5\Anaconda3\lib\site-packages\sklearn\ensemble\forest.py:245: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=None, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=10,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [16]:
testdata = pd.read_csv("sampleSubmission.csv")

In [17]:
testdata = testdata.fillna(0)
testdata.isnull().any()

id       False
label    False
ma5      False
ma10     False
ma15     False
cmo14    False
rsi6     False
mom10    False
dtype: bool

In [18]:
testdata.iloc[:, 2:]

             ma5       ma10       ma15      cmo14       rsi6      mom10
0      27.258000  27.573000  28.198000 -18.406644  43.920689  -2.510000
1      26.624000  26.698000  26.724667 -18.108538  36.866876  -0.500000
2      28.890000  28.863000  28.408667  21.578524  61.148764   0.549999
3      29.532000  30.037000  30.157333   5.401132  51.549343  -0.389999
4      31.514000  32.125000  32.192000  -5.607016  35.287002  -0.570002
...          ...        ...        ...        ...        ...        ...
11358  86.210001  86.955000  86.357333   0.348607  35.912823  -4.000000
11359  77.136000  80.214001  82.662001 -31.075438  25.796770 -10.879997
11360  70.966000  71.855001  72.971334 -16.918348  53.018605  -2.870003
11361  82.976001  79.619000  77.530667  29.211556  65.575880   6.629997
11362  81.462000  82.899000  84.118667  -3.340803  41.500225  -3.130005

[11363 rows x 6 columns]

In [19]:
result = clf.predict(testdata.iloc[:, 2:])

In [20]:
pd.DataFrame(result).to_excel("prediction.xlsx", index=False)